#include <bits/stdc++.h>
using namespace std;

// ll — просто короткая запись для long long.
// В олимпиадах этот тип используется очень часто,
// поэтому удобно сразу сделать такое сокращение.
using ll = long long;

// Всё решение одной задачи находится здесь.
// Если в задаче несколько тестов, solve() вызывается несколько раз.
void solve() {

}

int main() {
    // Эти две строки обычно ставим в начале main().
    // Они ускоряют работу cin/cout.
    ios::sync_with_stdio(false);
    cin.tie(nullptr);

    // Если в условии есть количество тестов:
    // например, сначала дано число t, а потом t задач.
    int t;
    cin >> t;

    while (t--) {
        solve();
    }

    return 0;
}